In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

seaborn contains datasets stored inbuilt in it we can simply call and use it

In [7]:
titanic = sns.load_dataset('titanic')
titanic_df = pd.DataFrame(titanic)
titanic_df.to_csv('C:/Users/abhin/OneDrive/Desktop/New folder/titanic_df.txt')

 based on survival which is 0 or 1 we group the data based on sex 
then we find out the percentage of people survived in first,second and third class

In [3]:
titanic.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

based on if they were alone or not then we group the data based on sex
then we calculate the percentage of people who were alone in 
first,second,third class

In [4]:
titanic.pivot_table('alone',index='sex',columns='class')

class      First    Second     Third
sex
female  0.361702  0.421053  0.416667
male    0.614754  0.666667  0.760807

 now based on if they were alive or dead and grouping them based on sex and then
caluculating the percentage of people and thier survival
(ie..)how many percent of people are alive and how many are dead in all the classes
based on gender

In [5]:
titanic.pivot_table('alive',index='sex',columns='class')

C:\Users\abhin\AppData\Local\Temp\ipykernel_1860\3943353654.py:1: FutureWarning: pivot_table dropped a column because it failed to aggregate. This behavior is deprecated and will raise in a future version of pandas. Select only the columns that can be aggregated.
  titanic.pivot_table('alive',index='sex',columns='class')

Empty DataFrame
Columns: []
Index: [female, male]

 this thing did not get accepted because the column ailve consists of data like yes or no which is not suitable or understnadable

# syntax:
    pivot _table(values= "", index ="",columns="",aggfunc="")
    pivot_table("#values","#index","#columns")
    pd.pivot_table(dataset,'#values','#index','#columns')

In [6]:
p1 = titanic.pivot_table('fare','sex','class')
p1

class        First     Second      Third
sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [7]:
pd.pivot_table(titanic,'fare','sex','class')

class        First     Second      Third
sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

# aggfunc

In [8]:
titanic.pivot_table(index='sex',columns='class',aggfunc={'survived':'count','fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       94     76   144
male     67.226127  19.741782  12.661633      122    108   347

In [12]:
titanic.pivot_table(index='sex', columns='class',
aggfunc={'survived':sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

 so basically here we use aggregate functions 
first we take the count of the survived based on the gender and class
second we take the mean of fare collected on each class gender based

# cut()

In [9]:
age_list = pd.cut(titanic['age'],[0,18,80])
titanic.pivot_table(values='fare',index=['sex',age_list],columns= 'class')

class                 First     Second      Third
sex    age
female (0, 18]   127.474245  25.064286  17.370835
       (18, 80]  105.043469  21.224653  14.785453
male   (0, 18]   114.638320  26.116947  20.639055
       (18, 80]   68.877389  20.219593  10.022624

so here basically we have used the cut function to cut the column 'age' in titanic and now we use 0-18 as a pair
then 18-80 as a pair
now we pass that as a index in the pivot table and based on the class and gender we calculate the fare

In [10]:
age_list = pd.cut(titanic['age'],[0,18,50,80])
titanic.pivot_table(values='fare',index=[age_list,'embark_town'],columns= 'class')

class                      First     Second      Third
age      embark_town
(0, 18]  Cherbourg    146.093750  30.163550  13.261122
         Queenstown          NaN        NaN  18.345312
         Southampton  109.884580  24.880000  20.795221
(18, 50] Cherbourg    115.413602  25.593182   9.889861
         Queenstown    90.000000  12.350000  10.319943
         Southampton   73.945945  20.745085  11.437905
(50, 80] Cherbourg     67.783340        NaN        NaN
         Queenstown          NaN  12.350000   7.750000
         Southampton   59.383874  17.037500   7.719275

In [8]:
import os

In [9]:
script_path = 'C:/Users/abhin/OneDrive/Desktop/New folder/sum.py'

In [10]:
os.system(f'python {script_path}')

2

In [14]:
!python C:/Users/abhin/OneDrive/Desktop/New folder/sum.py

python: can't open file 'C:\\Users\\abhin\\OneDrive\\Desktop\\New': [Errno 2] No such file or directory